{
  "transform_params" : {
    "input_2" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv1\/7x7_s2\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_49\/Relu",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "vggface_resnet50\/conv1\/7x7_s2\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input_2",
      "weights" : {
        "per_ch_qscale" : 7,
        "W_U4" : 3,
        "per_ch_qbias" : 5
      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "top" : "max_pool_7",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_7",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "vggface_resnet50\/activation_49\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_1_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_50\/Relu",
      "K" : 64,
      "blob_biases" : 9,
      "name" : "vggface_resnet50\/conv2_1_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pool_7",
      "weights" : {
        "per_ch_qscale" : 15,
        "W_U4" : 11,
        "per_ch_qbias" : 13
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_1_1x1_proj\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_373",
      "K" : 64,
      "blob_biases" : 17,
      "name" : "vggface_resnet50\/conv2_1_1x1_proj\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "max_pool_7",
      "weights" : {
        "per_ch_qscale" : 23,
        "W_U4" : 19,
        "per_ch_qbias" : 21
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_1_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_51\/Relu",
      "K" : 64,
      "blob_biases" : 25,
      "name" : "vggface_resnet50\/conv2_1_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_resnet50\/activation_50\/Relu",
      "weights" : {
        "per_ch_qscale" : 31,
        "W_U4" : 27,
        "per_ch_qbias" : 29
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_1_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_375",
      "K" : 64,
      "blob_biases" : 33,
      "name" : "vggface_resnet50\/conv2_1_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_51\/Relu",
      "weights" : {
        "per_ch_qscale" : 39,
        "W_U4" : 35,
        "per_ch_qbias" : 37
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "batch_norm_373,batch_norm_375",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_16\/add",
      "top" : "vggface_resnet50\/add_16\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_16\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_16\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_52\/Relu",
      "top" : "vggface_resnet50\/activation_52\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_52\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_2_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_53\/Relu",
      "K" : 256,
      "blob_biases" : 41,
      "name" : "vggface_resnet50\/conv2_2_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_resnet50\/activation_52\/Relu",
      "weights" : {
        "per_ch_qscale" : 47,
        "W_U4" : 43,
        "per_ch_qbias" : 45
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_2_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_54\/Relu",
      "K" : 64,
      "blob_biases" : 49,
      "name" : "vggface_resnet50\/conv2_2_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_resnet50\/activation_53\/Relu",
      "weights" : {
        "per_ch_qscale" : 55,
        "W_U4" : 51,
        "per_ch_qbias" : 53
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_2_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_378",
      "K" : 64,
      "blob_biases" : 57,
      "name" : "vggface_resnet50\/conv2_2_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_54\/Relu",
      "weights" : {
        "per_ch_qscale" : 63,
        "W_U4" : 59,
        "per_ch_qbias" : 61
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_52\/Relu,batch_norm_378",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_17\/add",
      "top" : "vggface_resnet50\/add_17\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_17\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_17\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_55\/Relu",
      "top" : "vggface_resnet50\/activation_55\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_55\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_3_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_56\/Relu",
      "K" : 256,
      "blob_biases" : 65,
      "name" : "vggface_resnet50\/conv2_3_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_resnet50\/activation_55\/Relu",
      "weights" : {
        "per_ch_qscale" : 71,
        "W_U4" : 67,
        "per_ch_qbias" : 69
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_3_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_57\/Relu",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "vggface_resnet50\/conv2_3_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_resnet50\/activation_56\/Relu",
      "weights" : {
        "per_ch_qscale" : 79,
        "W_U4" : 75,
        "per_ch_qbias" : 77
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv2_3_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_381",
      "K" : 64,
      "blob_biases" : 81,
      "name" : "vggface_resnet50\/conv2_3_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_57\/Relu",
      "weights" : {
        "per_ch_qscale" : 87,
        "W_U4" : 83,
        "per_ch_qbias" : 85
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_55\/Relu,batch_norm_381",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_18\/add",
      "top" : "vggface_resnet50\/add_18\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_18\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_18\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_58\/Relu",
      "top" : "vggface_resnet50\/activation_58\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_58\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_1_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_59\/Relu",
      "K" : 256,
      "blob_biases" : 89,
      "stride_x" : 2,
      "name" : "vggface_resnet50\/conv3_1_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_58\/Relu",
      "weights" : {
        "per_ch_qscale" : 95,
        "W_U4" : 91,
        "per_ch_qbias" : 93
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_1_1x1_proj\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_383",
      "K" : 256,
      "blob_biases" : 97,
      "stride_x" : 2,
      "name" : "vggface_resnet50\/conv3_1_1x1_proj\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_58\/Relu",
      "weights" : {
        "per_ch_qscale" : 103,
        "W_U4" : 99,
        "per_ch_qbias" : 101
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_1_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_60\/Relu",
      "K" : 128,
      "blob_biases" : 105,
      "name" : "vggface_resnet50\/conv3_1_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_59\/Relu",
      "weights" : {
        "per_ch_qscale" : 111,
        "W_U4" : 107,
        "per_ch_qbias" : 109
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_1_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_385",
      "K" : 128,
      "blob_biases" : 113,
      "name" : "vggface_resnet50\/conv3_1_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_60\/Relu",
      "weights" : {
        "per_ch_qscale" : 119,
        "W_U4" : 115,
        "per_ch_qbias" : 117
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "batch_norm_383,batch_norm_385",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_19\/add",
      "top" : "vggface_resnet50\/add_19\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_19\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_19\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_61\/Relu",
      "top" : "vggface_resnet50\/activation_61\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_61\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_2_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_62\/Relu",
      "K" : 512,
      "blob_biases" : 121,
      "name" : "vggface_resnet50\/conv3_2_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_61\/Relu",
      "weights" : {
        "per_ch_qscale" : 127,
        "W_U4" : 123,
        "per_ch_qbias" : 125
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_2_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_63\/Relu",
      "K" : 128,
      "blob_biases" : 129,
      "name" : "vggface_resnet50\/conv3_2_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_62\/Relu",
      "weights" : {
        "per_ch_qscale" : 135,
        "W_U4" : 131,
        "per_ch_qbias" : 133
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_2_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_388",
      "K" : 128,
      "blob_biases" : 137,
      "name" : "vggface_resnet50\/conv3_2_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_63\/Relu",
      "weights" : {
        "per_ch_qscale" : 143,
        "W_U4" : 139,
        "per_ch_qbias" : 141
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_61\/Relu,batch_norm_388",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_20\/add",
      "top" : "vggface_resnet50\/add_20\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_20\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_20\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_64\/Relu",
      "top" : "vggface_resnet50\/activation_64\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_64\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_3_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_65\/Relu",
      "K" : 512,
      "blob_biases" : 145,
      "name" : "vggface_resnet50\/conv3_3_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_64\/Relu",
      "weights" : {
        "per_ch_qscale" : 151,
        "W_U4" : 147,
        "per_ch_qbias" : 149
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_3_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_66\/Relu",
      "K" : 128,
      "blob_biases" : 153,
      "name" : "vggface_resnet50\/conv3_3_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_65\/Relu",
      "weights" : {
        "per_ch_qscale" : 159,
        "W_U4" : 155,
        "per_ch_qbias" : 157
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_3_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_391",
      "K" : 128,
      "blob_biases" : 161,
      "name" : "vggface_resnet50\/conv3_3_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_66\/Relu",
      "weights" : {
        "per_ch_qscale" : 167,
        "W_U4" : 163,
        "per_ch_qbias" : 165
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_64\/Relu,batch_norm_391",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_21\/add",
      "top" : "vggface_resnet50\/add_21\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_21\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_21\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_67\/Relu",
      "top" : "vggface_resnet50\/activation_67\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_67\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_4_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_68\/Relu",
      "K" : 512,
      "blob_biases" : 169,
      "name" : "vggface_resnet50\/conv3_4_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_67\/Relu",
      "weights" : {
        "per_ch_qscale" : 175,
        "W_U4" : 171,
        "per_ch_qbias" : 173
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_4_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_69\/Relu",
      "K" : 128,
      "blob_biases" : 177,
      "name" : "vggface_resnet50\/conv3_4_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_resnet50\/activation_68\/Relu",
      "weights" : {
        "per_ch_qscale" : 183,
        "W_U4" : 179,
        "per_ch_qbias" : 181
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv3_4_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_394",
      "K" : 128,
      "blob_biases" : 185,
      "name" : "vggface_resnet50\/conv3_4_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_69\/Relu",
      "weights" : {
        "per_ch_qscale" : 191,
        "W_U4" : 187,
        "per_ch_qbias" : 189
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_67\/Relu,batch_norm_394",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_22\/add",
      "top" : "vggface_resnet50\/add_22\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_22\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_22\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_70\/Relu",
      "top" : "vggface_resnet50\/activation_70\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_70\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_1_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_71\/Relu",
      "K" : 512,
      "blob_biases" : 193,
      "stride_x" : 2,
      "name" : "vggface_resnet50\/conv4_1_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_70\/Relu",
      "weights" : {
        "per_ch_qscale" : 199,
        "W_U4" : 195,
        "per_ch_qbias" : 197
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_1_1x1_proj\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_396",
      "K" : 512,
      "blob_biases" : 201,
      "stride_x" : 2,
      "name" : "vggface_resnet50\/conv4_1_1x1_proj\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "vggface_resnet50\/activation_70\/Relu",
      "weights" : {
        "per_ch_qscale" : 207,
        "W_U4" : 203,
        "per_ch_qbias" : 205
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_1_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_72\/Relu",
      "K" : 256,
      "blob_biases" : 209,
      "name" : "vggface_resnet50\/conv4_1_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_71\/Relu",
      "weights" : {
        "per_ch_qscale" : 215,
        "W_U4" : 211,
        "per_ch_qbias" : 213
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_1_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_398",
      "K" : 256,
      "blob_biases" : 217,
      "name" : "vggface_resnet50\/conv4_1_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "vggface_resnet50\/activation_72\/Relu",
      "weights" : {
        "per_ch_qscale" : 223,
        "W_U4" : 219,
        "per_ch_qbias" : 221
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "batch_norm_396,batch_norm_398",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_23\/add",
      "top" : "vggface_resnet50\/add_23\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_23\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_23\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_73\/Relu",
      "top" : "vggface_resnet50\/activation_73\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_73\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_2_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_74\/Relu",
      "K" : 1024,
      "blob_biases" : 225,
      "name" : "vggface_resnet50\/conv4_2_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_73\/Relu",
      "weights" : {
        "per_ch_qscale" : 231,
        "W_U4" : 227,
        "per_ch_qbias" : 229
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_2_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_75\/Relu",
      "K" : 256,
      "blob_biases" : 233,
      "name" : "vggface_resnet50\/conv4_2_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_74\/Relu",
      "weights" : {
        "per_ch_qscale" : 239,
        "W_U4" : 235,
        "per_ch_qbias" : 237
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_2_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_401",
      "K" : 256,
      "blob_biases" : 241,
      "name" : "vggface_resnet50\/conv4_2_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "vggface_resnet50\/activation_75\/Relu",
      "weights" : {
        "per_ch_qscale" : 247,
        "W_U4" : 243,
        "per_ch_qbias" : 245
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_73\/Relu,batch_norm_401",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_24\/add",
      "top" : "vggface_resnet50\/add_24\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_24\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_24\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_76\/Relu",
      "top" : "vggface_resnet50\/activation_76\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_76\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_3_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_77\/Relu",
      "K" : 1024,
      "blob_biases" : 249,
      "name" : "vggface_resnet50\/conv4_3_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_76\/Relu",
      "weights" : {
        "per_ch_qscale" : 255,
        "W_U4" : 251,
        "per_ch_qbias" : 253
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_3_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_78\/Relu",
      "K" : 256,
      "blob_biases" : 257,
      "name" : "vggface_resnet50\/conv4_3_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_77\/Relu",
      "weights" : {
        "per_ch_qscale" : 263,
        "W_U4" : 259,
        "per_ch_qbias" : 261
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_3_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_404",
      "K" : 256,
      "blob_biases" : 265,
      "name" : "vggface_resnet50\/conv4_3_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "vggface_resnet50\/activation_78\/Relu",
      "weights" : {
        "per_ch_qscale" : 271,
        "W_U4" : 267,
        "per_ch_qbias" : 269
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_76\/Relu,batch_norm_404",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_25\/add",
      "top" : "vggface_resnet50\/add_25\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_25\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_25\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_79\/Relu",
      "top" : "vggface_resnet50\/activation_79\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_79\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_4_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_80\/Relu",
      "K" : 1024,
      "blob_biases" : 273,
      "name" : "vggface_resnet50\/conv4_4_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_79\/Relu",
      "weights" : {
        "per_ch_qscale" : 279,
        "W_U4" : 275,
        "per_ch_qbias" : 277
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_4_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_81\/Relu",
      "K" : 256,
      "blob_biases" : 281,
      "name" : "vggface_resnet50\/conv4_4_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_80\/Relu",
      "weights" : {
        "per_ch_qscale" : 287,
        "W_U4" : 283,
        "per_ch_qbias" : 285
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_4_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_407",
      "K" : 256,
      "blob_biases" : 289,
      "name" : "vggface_resnet50\/conv4_4_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "vggface_resnet50\/activation_81\/Relu",
      "weights" : {
        "per_ch_qscale" : 295,
        "W_U4" : 291,
        "per_ch_qbias" : 293
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_79\/Relu,batch_norm_407",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_26\/add",
      "top" : "vggface_resnet50\/add_26\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_26\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_26\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_82\/Relu",
      "top" : "vggface_resnet50\/activation_82\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_82\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_5_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_83\/Relu",
      "K" : 1024,
      "blob_biases" : 297,
      "name" : "vggface_resnet50\/conv4_5_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_82\/Relu",
      "weights" : {
        "per_ch_qscale" : 303,
        "W_U4" : 299,
        "per_ch_qbias" : 301
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_5_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_84\/Relu",
      "K" : 256,
      "blob_biases" : 305,
      "name" : "vggface_resnet50\/conv4_5_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_83\/Relu",
      "weights" : {
        "per_ch_qscale" : 311,
        "W_U4" : 307,
        "per_ch_qbias" : 309
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_5_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_410",
      "K" : 256,
      "blob_biases" : 313,
      "name" : "vggface_resnet50\/conv4_5_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "vggface_resnet50\/activation_84\/Relu",
      "weights" : {
        "per_ch_qscale" : 319,
        "W_U4" : 315,
        "per_ch_qbias" : 317
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_82\/Relu,batch_norm_410",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_27\/add",
      "top" : "vggface_resnet50\/add_27\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_27\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_27\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_85\/Relu",
      "top" : "vggface_resnet50\/activation_85\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_85\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_6_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_86\/Relu",
      "K" : 1024,
      "blob_biases" : 321,
      "name" : "vggface_resnet50\/conv4_6_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_85\/Relu",
      "weights" : {
        "per_ch_qscale" : 327,
        "W_U4" : 323,
        "per_ch_qbias" : 325
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_6_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_87\/Relu",
      "K" : 256,
      "blob_biases" : 329,
      "name" : "vggface_resnet50\/conv4_6_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_resnet50\/activation_86\/Relu",
      "weights" : {
        "per_ch_qscale" : 335,
        "W_U4" : 331,
        "per_ch_qbias" : 333
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv4_6_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_413",
      "K" : 256,
      "blob_biases" : 337,
      "name" : "vggface_resnet50\/conv4_6_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "vggface_resnet50\/activation_87\/Relu",
      "weights" : {
        "per_ch_qscale" : 343,
        "W_U4" : 339,
        "per_ch_qbias" : 341
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_85\/Relu,batch_norm_413",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_28\/add",
      "top" : "vggface_resnet50\/add_28\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_28\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_28\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_88\/Relu",
      "top" : "vggface_resnet50\/activation_88\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_88\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv5_1_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_89\/Relu",
      "K" : 1024,
      "blob_biases" : 345,
      "stride_x" : 2,
      "name" : "vggface_resnet50\/conv5_1_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_88\/Relu",
      "weights" : {
        "per_ch_qscale" : 351,
        "W_U4" : 347,
        "per_ch_qbias" : 349
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv5_1_1x1_proj\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_415",
      "K" : 1024,
      "blob_biases" : 353,
      "stride_x" : 2,
      "name" : "vggface_resnet50\/conv5_1_1x1_proj\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 2048,
      "bottom" : "vggface_resnet50\/activation_88\/Relu",
      "weights" : {
        "per_ch_qscale" : 359,
        "W_U4" : 355,
        "per_ch_qbias" : 357
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv5_1_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_90\/Relu",
      "K" : 512,
      "blob_biases" : 361,
      "name" : "vggface_resnet50\/conv5_1_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_89\/Relu",
      "weights" : {
        "per_ch_qscale" : 367,
        "W_U4" : 363,
        "per_ch_qbias" : 365
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv5_1_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_417",
      "K" : 512,
      "blob_biases" : 369,
      "name" : "vggface_resnet50\/conv5_1_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2048,
      "bottom" : "vggface_resnet50\/activation_90\/Relu",
      "weights" : {
        "per_ch_qscale" : 375,
        "W_U4" : 371,
        "per_ch_qbias" : 373
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "batch_norm_415,batch_norm_417",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_29\/add",
      "top" : "vggface_resnet50\/add_29\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_29\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_29\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_91\/Relu",
      "top" : "vggface_resnet50\/activation_91\/Relu",
      "type" : "activation",
      "name" : "vggface_resnet50\/activation_91\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv5_2_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_92\/Relu",
      "K" : 2048,
      "blob_biases" : 377,
      "name" : "vggface_resnet50\/conv5_2_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_91\/Relu",
      "weights" : {
        "per_ch_qscale" : 383,
        "W_U4" : 379,
        "per_ch_qbias" : 381
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv5_2_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_resnet50\/activation_93\/Relu",
      "K" : 512,
      "blob_biases" : 385,
      "name" : "vggface_resnet50\/conv5_2_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_resnet50\/activation_92\/Relu",
      "weights" : {
        "per_ch_qscale" : 391,
        "W_U4" : 387,
        "per_ch_qbias" : 389
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_resnet50\/conv5_2_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_420",
      "K" : 512,
      "blob_biases" : 393,
      "name" : "vggface_resnet50\/conv5_2_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2048,
      "bottom" : "vggface_resnet50\/activation_93\/Relu",
      "weights" : {
        "per_ch_qscale" : 399,
        "W_U4" : 395,
        "per_ch_qbias" : 397
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_resnet50\/activation_91\/Relu,batch_norm_420",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_resnet50\/add_30\/add",
      "top" : "vggface_resnet50\/add_30\/add",
      "type" : "elementwise",
      "name" : "vggface_resnet50\/add_30\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_resnet50\/add_30\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_resnet50\/activation_94\/Relu",
      "top" : "vggface_resnet50\/activation_94\/Relu",
      "type" : "activation",
