{
  "transform_params" : {
    "input_1" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv1\/7x7_s2\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation\/Relu",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "vggface_senet50\/conv1\/7x7_s2\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input_1",
      "weights" : {
        "per_ch_qscale" : 7,
        "W_U4" : 3,
        "per_ch_qbias" : 5
      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pool_0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "top" : "max_pool_0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pool_0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "vggface_senet50\/activation\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_1_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_1\/Relu",
      "K" : 64,
      "blob_biases" : 9,
      "name" : "vggface_senet50\/conv2_1_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pool_0",
      "weights" : {
        "per_ch_qscale" : 15,
        "W_U4" : 11,
        "per_ch_qbias" : 13
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_1_1x1_proj\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_2",
      "K" : 64,
      "blob_biases" : 17,
      "name" : "vggface_senet50\/conv2_1_1x1_proj\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "max_pool_0",
      "weights" : {
        "per_ch_qscale" : 23,
        "W_U4" : 19,
        "per_ch_qbias" : 21
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_1_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_2\/Relu",
      "K" : 64,
      "blob_biases" : 25,
      "name" : "vggface_senet50\/conv2_1_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_senet50\/activation_1\/Relu",
      "weights" : {
        "per_ch_qscale" : 31,
        "W_U4" : 27,
        "per_ch_qbias" : 29
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_1_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_4",
      "K" : 64,
      "blob_biases" : 33,
      "name" : "vggface_senet50\/conv2_1_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_senet50\/activation_2\/Relu",
      "weights" : {
        "per_ch_qscale" : 39,
        "W_U4" : 35,
        "per_ch_qbias" : 37
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "batch_norm_4",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_225",
      "top" : "transpose_225",
      "type" : "transpose",
      "name" : "transpose_225"
    },
    {
      "axis_mode" : 4,
      "bottom" : "transpose_225",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d\/Mean",
      "use_version" : 1,
      "top" : "transpose_2251",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "transpose_2251",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d\/Mean",
      "use_version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d\/Mean_squeeze",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d\/Mean"
    },
    {
      "size_of_axes" : 2,
      "bottom" : "vggface_senet50\/global_average_pooling2d\/Mean_squeeze",
      "axes_0" : 1,
      "axes_1" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "vggface_senet50\/global_average_pooling2d\/Mean",
      "version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d\/Mean",
      "type" : "squeeze",
      "name" : "vggface_senet50\/global_average_pooling2d\/Mean"
    },
    {
      "name" : "vggface_senet50\/reshape\/Reshape",
      "weights" : {

      },
      "dst_w" : 256,
      "version" : 1,
      "dst_n" : -1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "vggface_senet50\/global_average_pooling2d\/Mean",
      "debug_info" : "vggface_senet50\/reshape\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "vggface_senet50\/reshape\/Reshape"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "vggface_senet50\/reshape\/Reshape",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_17",
      "top" : "transpose_17",
      "type" : "transpose",
      "name" : "transpose_17"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_1_1x1_down\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_3\/Relu",
      "K" : 256,
      "blob_biases" : 41,
      "name" : "vggface_senet50\/conv2_1_1x1_down\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "transpose_17",
      "weights" : {
        "per_ch_qscale" : 47,
        "W_U4" : 43,
        "per_ch_qbias" : 45
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_1_1x1_up\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/conv2_1_1x1_up\/BiasAdd",
      "K" : 16,
      "blob_biases" : 49,
      "name" : "vggface_senet50\/conv2_1_1x1_up\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_senet50\/activation_3\/Relu",
      "weights" : {
        "per_ch_qscale" : 55,
        "W_U4" : 51,
        "per_ch_qbias" : 53
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_senet50\/conv2_1_1x1_up\/BiasAdd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "vggface_senet50\/activation_4\/Sigmoid",
      "top" : "vggface_senet50\/activation_4\/Sigmoid",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_4\/Sigmoid"
    },
    {
      "bottom" : "batch_norm_4,vggface_senet50\/activation_4\/Sigmoid",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/multiply\/mul",
      "nd_mode" : true,
      "top" : "vggface_senet50\/multiply\/mul",
      "type" : "elementwise",
      "name" : "vggface_senet50\/multiply\/mul",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/multiply\/mul,batch_norm_2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/add\/add",
      "nd_mode" : true,
      "top" : "vggface_senet50\/add\/add",
      "type" : "elementwise",
      "name" : "vggface_senet50\/add\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/add\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_senet50\/activation_5\/Relu",
      "top" : "vggface_senet50\/activation_5\/Relu",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_5\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_2_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_6\/Relu",
      "K" : 256,
      "blob_biases" : 57,
      "name" : "vggface_senet50\/conv2_2_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_senet50\/activation_5\/Relu",
      "weights" : {
        "per_ch_qscale" : 63,
        "W_U4" : 59,
        "per_ch_qbias" : 61
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_2_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_7\/Relu",
      "K" : 64,
      "blob_biases" : 65,
      "name" : "vggface_senet50\/conv2_2_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_senet50\/activation_6\/Relu",
      "weights" : {
        "per_ch_qscale" : 71,
        "W_U4" : 67,
        "per_ch_qbias" : 69
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_2_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_7",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "vggface_senet50\/conv2_2_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_senet50\/activation_7\/Relu",
      "weights" : {
        "per_ch_qscale" : 79,
        "W_U4" : 75,
        "per_ch_qbias" : 77
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "batch_norm_7",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_226",
      "top" : "transpose_226",
      "type" : "transpose",
      "name" : "transpose_226"
    },
    {
      "axis_mode" : 4,
      "bottom" : "transpose_226",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_1\/Mean",
      "use_version" : 1,
      "top" : "transpose_2261",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_1\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "transpose_2261",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_1\/Mean",
      "use_version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_1\/Mean_squeeze",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_1\/Mean"
    },
    {
      "size_of_axes" : 2,
      "bottom" : "vggface_senet50\/global_average_pooling2d_1\/Mean_squeeze",
      "axes_0" : 1,
      "axes_1" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_1\/Mean",
      "version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_1\/Mean",
      "type" : "squeeze",
      "name" : "vggface_senet50\/global_average_pooling2d_1\/Mean"
    },
    {
      "name" : "vggface_senet50\/reshape_1\/Reshape",
      "weights" : {

      },
      "dst_w" : 256,
      "version" : 1,
      "dst_n" : -1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "vggface_senet50\/global_average_pooling2d_1\/Mean",
      "debug_info" : "vggface_senet50\/reshape_1\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "vggface_senet50\/reshape_1\/Reshape"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "vggface_senet50\/reshape_1\/Reshape",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_30",
      "top" : "transpose_30",
      "type" : "transpose",
      "name" : "transpose_30"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_2_1x1_down\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_8\/Relu",
      "K" : 256,
      "blob_biases" : 81,
      "name" : "vggface_senet50\/conv2_2_1x1_down\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "transpose_30",
      "weights" : {
        "per_ch_qscale" : 87,
        "W_U4" : 83,
        "per_ch_qbias" : 85
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_2_1x1_up\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/conv2_2_1x1_up\/BiasAdd",
      "K" : 16,
      "blob_biases" : 89,
      "name" : "vggface_senet50\/conv2_2_1x1_up\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_senet50\/activation_8\/Relu",
      "weights" : {
        "per_ch_qscale" : 95,
        "W_U4" : 91,
        "per_ch_qbias" : 93
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_senet50\/conv2_2_1x1_up\/BiasAdd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "vggface_senet50\/activation_9\/Sigmoid",
      "top" : "vggface_senet50\/activation_9\/Sigmoid",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_9\/Sigmoid"
    },
    {
      "bottom" : "batch_norm_7,vggface_senet50\/activation_9\/Sigmoid",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/multiply_1\/mul",
      "nd_mode" : true,
      "top" : "vggface_senet50\/multiply_1\/mul",
      "type" : "elementwise",
      "name" : "vggface_senet50\/multiply_1\/mul",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/multiply_1\/mul,vggface_senet50\/activation_5\/Relu",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/add_1\/add",
      "nd_mode" : true,
      "top" : "vggface_senet50\/add_1\/add",
      "type" : "elementwise",
      "name" : "vggface_senet50\/add_1\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/add_1\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_senet50\/activation_10\/Relu",
      "top" : "vggface_senet50\/activation_10\/Relu",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_10\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_3_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_11\/Relu",
      "K" : 256,
      "blob_biases" : 97,
      "name" : "vggface_senet50\/conv2_3_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_senet50\/activation_10\/Relu",
      "weights" : {
        "per_ch_qscale" : 103,
        "W_U4" : 99,
        "per_ch_qbias" : 101
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_3_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_12\/Relu",
      "K" : 64,
      "blob_biases" : 105,
      "name" : "vggface_senet50\/conv2_3_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "vggface_senet50\/activation_11\/Relu",
      "weights" : {
        "per_ch_qscale" : 111,
        "W_U4" : 107,
        "per_ch_qbias" : 109
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_3_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_10",
      "K" : 64,
      "blob_biases" : 113,
      "name" : "vggface_senet50\/conv2_3_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_senet50\/activation_12\/Relu",
      "weights" : {
        "per_ch_qscale" : 119,
        "W_U4" : 115,
        "per_ch_qbias" : 117
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "batch_norm_10",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_227",
      "top" : "transpose_227",
      "type" : "transpose",
      "name" : "transpose_227"
    },
    {
      "axis_mode" : 4,
      "bottom" : "transpose_227",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_2\/Mean",
      "use_version" : 1,
      "top" : "transpose_2271",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_2\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "transpose_2271",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_2\/Mean",
      "use_version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_2\/Mean_squeeze",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_2\/Mean"
    },
    {
      "size_of_axes" : 2,
      "bottom" : "vggface_senet50\/global_average_pooling2d_2\/Mean_squeeze",
      "axes_0" : 1,
      "axes_1" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_2\/Mean",
      "version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_2\/Mean",
      "type" : "squeeze",
      "name" : "vggface_senet50\/global_average_pooling2d_2\/Mean"
    },
    {
      "name" : "vggface_senet50\/reshape_2\/Reshape",
      "weights" : {

      },
      "dst_w" : 256,
      "version" : 1,
      "dst_n" : -1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "vggface_senet50\/global_average_pooling2d_2\/Mean",
      "debug_info" : "vggface_senet50\/reshape_2\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "vggface_senet50\/reshape_2\/Reshape"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "vggface_senet50\/reshape_2\/Reshape",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_43",
      "top" : "transpose_43",
      "type" : "transpose",
      "name" : "transpose_43"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_3_1x1_down\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_13\/Relu",
      "K" : 256,
      "blob_biases" : 121,
      "name" : "vggface_senet50\/conv2_3_1x1_down\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "transpose_43",
      "weights" : {
        "per_ch_qscale" : 127,
        "W_U4" : 123,
        "per_ch_qbias" : 125
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv2_3_1x1_up\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/conv2_3_1x1_up\/BiasAdd",
      "K" : 16,
      "blob_biases" : 129,
      "name" : "vggface_senet50\/conv2_3_1x1_up\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "vggface_senet50\/activation_13\/Relu",
      "weights" : {
        "per_ch_qscale" : 135,
        "W_U4" : 131,
        "per_ch_qbias" : 133
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_senet50\/conv2_3_1x1_up\/BiasAdd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "vggface_senet50\/activation_14\/Sigmoid",
      "top" : "vggface_senet50\/activation_14\/Sigmoid",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_14\/Sigmoid"
    },
    {
      "bottom" : "batch_norm_10,vggface_senet50\/activation_14\/Sigmoid",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/multiply_2\/mul",
      "nd_mode" : true,
      "top" : "vggface_senet50\/multiply_2\/mul",
      "type" : "elementwise",
      "name" : "vggface_senet50\/multiply_2\/mul",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/multiply_2\/mul,vggface_senet50\/activation_10\/Relu",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/add_2\/add",
      "nd_mode" : true,
      "top" : "vggface_senet50\/add_2\/add",
      "type" : "elementwise",
      "name" : "vggface_senet50\/add_2\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/add_2\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_senet50\/activation_15\/Relu",
      "top" : "vggface_senet50\/activation_15\/Relu",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_15\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_1_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_16\/Relu",
      "K" : 256,
      "blob_biases" : 137,
      "stride_x" : 2,
      "name" : "vggface_senet50\/conv3_1_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_senet50\/activation_15\/Relu",
      "weights" : {
        "per_ch_qscale" : 143,
        "W_U4" : 139,
        "per_ch_qbias" : 141
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_1_1x1_proj\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_12",
      "K" : 256,
      "blob_biases" : 145,
      "stride_x" : 2,
      "name" : "vggface_senet50\/conv3_1_1x1_proj\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_senet50\/activation_15\/Relu",
      "weights" : {
        "per_ch_qscale" : 151,
        "W_U4" : 147,
        "per_ch_qbias" : 149
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_1_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_17\/Relu",
      "K" : 128,
      "blob_biases" : 153,
      "name" : "vggface_senet50\/conv3_1_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_senet50\/activation_16\/Relu",
      "weights" : {
        "per_ch_qscale" : 159,
        "W_U4" : 155,
        "per_ch_qbias" : 157
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_1_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_14",
      "K" : 128,
      "blob_biases" : 161,
      "name" : "vggface_senet50\/conv3_1_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_senet50\/activation_17\/Relu",
      "weights" : {
        "per_ch_qscale" : 167,
        "W_U4" : 163,
        "per_ch_qbias" : 165
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "batch_norm_14",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_228",
      "top" : "transpose_228",
      "type" : "transpose",
      "name" : "transpose_228"
    },
    {
      "axis_mode" : 4,
      "bottom" : "transpose_228",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_3\/Mean",
      "use_version" : 1,
      "top" : "transpose_2281",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_3\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "transpose_2281",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_3\/Mean",
      "use_version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_3\/Mean_squeeze",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_3\/Mean"
    },
    {
      "size_of_axes" : 2,
      "bottom" : "vggface_senet50\/global_average_pooling2d_3\/Mean_squeeze",
      "axes_0" : 1,
      "axes_1" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_3\/Mean",
      "version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_3\/Mean",
      "type" : "squeeze",
      "name" : "vggface_senet50\/global_average_pooling2d_3\/Mean"
    },
    {
      "name" : "vggface_senet50\/reshape_3\/Reshape",
      "weights" : {

      },
      "dst_w" : 512,
      "version" : 1,
      "dst_n" : -1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "vggface_senet50\/global_average_pooling2d_3\/Mean",
      "debug_info" : "vggface_senet50\/reshape_3\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "vggface_senet50\/reshape_3\/Reshape"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "vggface_senet50\/reshape_3\/Reshape",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_59",
      "top" : "transpose_59",
      "type" : "transpose",
      "name" : "transpose_59"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_1_1x1_down\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_18\/Relu",
      "K" : 512,
      "blob_biases" : 169,
      "name" : "vggface_senet50\/conv3_1_1x1_down\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_59",
      "weights" : {
        "per_ch_qscale" : 175,
        "W_U4" : 171,
        "per_ch_qbias" : 173
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_1_1x1_up\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/conv3_1_1x1_up\/BiasAdd",
      "K" : 32,
      "blob_biases" : 177,
      "name" : "vggface_senet50\/conv3_1_1x1_up\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_senet50\/activation_18\/Relu",
      "weights" : {
        "per_ch_qscale" : 183,
        "W_U4" : 179,
        "per_ch_qbias" : 181
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_senet50\/conv3_1_1x1_up\/BiasAdd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "vggface_senet50\/activation_19\/Sigmoid",
      "top" : "vggface_senet50\/activation_19\/Sigmoid",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_19\/Sigmoid"
    },
    {
      "bottom" : "batch_norm_14,vggface_senet50\/activation_19\/Sigmoid",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/multiply_3\/mul",
      "nd_mode" : true,
      "top" : "vggface_senet50\/multiply_3\/mul",
      "type" : "elementwise",
      "name" : "vggface_senet50\/multiply_3\/mul",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/multiply_3\/mul,batch_norm_12",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/add_3\/add",
      "nd_mode" : true,
      "top" : "vggface_senet50\/add_3\/add",
      "type" : "elementwise",
      "name" : "vggface_senet50\/add_3\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/add_3\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_senet50\/activation_20\/Relu",
      "top" : "vggface_senet50\/activation_20\/Relu",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_20\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_2_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_21\/Relu",
      "K" : 512,
      "blob_biases" : 185,
      "name" : "vggface_senet50\/conv3_2_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_senet50\/activation_20\/Relu",
      "weights" : {
        "per_ch_qscale" : 191,
        "W_U4" : 187,
        "per_ch_qbias" : 189
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_2_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_22\/Relu",
      "K" : 128,
      "blob_biases" : 193,
      "name" : "vggface_senet50\/conv3_2_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_senet50\/activation_21\/Relu",
      "weights" : {
        "per_ch_qscale" : 199,
        "W_U4" : 195,
        "per_ch_qbias" : 197
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_2_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_17",
      "K" : 128,
      "blob_biases" : 201,
      "name" : "vggface_senet50\/conv3_2_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_senet50\/activation_22\/Relu",
      "weights" : {
        "per_ch_qscale" : 207,
        "W_U4" : 203,
        "per_ch_qbias" : 205
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "batch_norm_17",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_229",
      "top" : "transpose_229",
      "type" : "transpose",
      "name" : "transpose_229"
    },
    {
      "axis_mode" : 4,
      "bottom" : "transpose_229",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_4\/Mean",
      "use_version" : 1,
      "top" : "transpose_2291",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_4\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "transpose_2291",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_4\/Mean",
      "use_version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_4\/Mean_squeeze",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_4\/Mean"
    },
    {
      "size_of_axes" : 2,
      "bottom" : "vggface_senet50\/global_average_pooling2d_4\/Mean_squeeze",
      "axes_0" : 1,
      "axes_1" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_4\/Mean",
      "version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_4\/Mean",
      "type" : "squeeze",
      "name" : "vggface_senet50\/global_average_pooling2d_4\/Mean"
    },
    {
      "name" : "vggface_senet50\/reshape_4\/Reshape",
      "weights" : {

      },
      "dst_w" : 512,
      "version" : 1,
      "dst_n" : -1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "vggface_senet50\/global_average_pooling2d_4\/Mean",
      "debug_info" : "vggface_senet50\/reshape_4\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "vggface_senet50\/reshape_4\/Reshape"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "vggface_senet50\/reshape_4\/Reshape",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_72",
      "top" : "transpose_72",
      "type" : "transpose",
      "name" : "transpose_72"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_2_1x1_down\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_23\/Relu",
      "K" : 512,
      "blob_biases" : 209,
      "name" : "vggface_senet50\/conv3_2_1x1_down\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_72",
      "weights" : {
        "per_ch_qscale" : 215,
        "W_U4" : 211,
        "per_ch_qbias" : 213
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_2_1x1_up\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/conv3_2_1x1_up\/BiasAdd",
      "K" : 32,
      "blob_biases" : 217,
      "name" : "vggface_senet50\/conv3_2_1x1_up\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_senet50\/activation_23\/Relu",
      "weights" : {
        "per_ch_qscale" : 223,
        "W_U4" : 219,
        "per_ch_qbias" : 221
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_senet50\/conv3_2_1x1_up\/BiasAdd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "vggface_senet50\/activation_24\/Sigmoid",
      "top" : "vggface_senet50\/activation_24\/Sigmoid",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_24\/Sigmoid"
    },
    {
      "bottom" : "batch_norm_17,vggface_senet50\/activation_24\/Sigmoid",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/multiply_4\/mul",
      "nd_mode" : true,
      "top" : "vggface_senet50\/multiply_4\/mul",
      "type" : "elementwise",
      "name" : "vggface_senet50\/multiply_4\/mul",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/multiply_4\/mul,vggface_senet50\/activation_20\/Relu",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/add_4\/add",
      "nd_mode" : true,
      "top" : "vggface_senet50\/add_4\/add",
      "type" : "elementwise",
      "name" : "vggface_senet50\/add_4\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/add_4\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_senet50\/activation_25\/Relu",
      "top" : "vggface_senet50\/activation_25\/Relu",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_25\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_3_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_26\/Relu",
      "K" : 512,
      "blob_biases" : 225,
      "name" : "vggface_senet50\/conv3_3_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_senet50\/activation_25\/Relu",
      "weights" : {
        "per_ch_qscale" : 231,
        "W_U4" : 227,
        "per_ch_qbias" : 229
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_3_3x3\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_27\/Relu",
      "K" : 128,
      "blob_biases" : 233,
      "name" : "vggface_senet50\/conv3_3_3x3\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_senet50\/activation_26\/Relu",
      "weights" : {
        "per_ch_qscale" : 239,
        "W_U4" : 235,
        "per_ch_qbias" : 237
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_3_1x1_increase\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "batch_norm_20",
      "K" : 128,
      "blob_biases" : 241,
      "name" : "vggface_senet50\/conv3_3_1x1_increase\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_senet50\/activation_27\/Relu",
      "weights" : {
        "per_ch_qscale" : 247,
        "W_U4" : 243,
        "per_ch_qbias" : 245
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "axis_h" : 0,
      "axis_w" : 2,
      "bottom" : "batch_norm_20",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_230",
      "top" : "transpose_230",
      "type" : "transpose",
      "name" : "transpose_230"
    },
    {
      "axis_mode" : 4,
      "bottom" : "transpose_230",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 1,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_5\/Mean",
      "use_version" : 1,
      "top" : "transpose_2301",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_5\/Mean0"
    },
    {
      "axis_mode" : 2,
      "bottom" : "transpose_2301",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 2,
      "nd_mode" : true,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_5\/Mean",
      "use_version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_5\/Mean_squeeze",
      "type" : "reduce",
      "name" : "vggface_senet50\/global_average_pooling2d_5\/Mean"
    },
    {
      "size_of_axes" : 2,
      "bottom" : "vggface_senet50\/global_average_pooling2d_5\/Mean_squeeze",
      "axes_0" : 1,
      "axes_1" : 2,
      "weights" : {

      },
      "nd_axis" : 0,
      "debug_info" : "vggface_senet50\/global_average_pooling2d_5\/Mean",
      "version" : 1,
      "top" : "vggface_senet50\/global_average_pooling2d_5\/Mean",
      "type" : "squeeze",
      "name" : "vggface_senet50\/global_average_pooling2d_5\/Mean"
    },
    {
      "name" : "vggface_senet50\/reshape_5\/Reshape",
      "weights" : {

      },
      "dst_w" : 512,
      "version" : 1,
      "dst_n" : -1,
      "dst_nd_rank" : 4,
      "type" : "reshape",
      "dst_h" : 1,
      "mode" : 0,
      "dynamic_shape" : false,
      "bottom" : "vggface_senet50\/global_average_pooling2d_5\/Mean",
      "debug_info" : "vggface_senet50\/reshape_5\/Reshape",
      "dst_seq" : 1,
      "dst_k" : 1,
      "top" : "vggface_senet50\/reshape_5\/Reshape"
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "vggface_senet50\/reshape_5\/Reshape",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_85",
      "top" : "transpose_85",
      "type" : "transpose",
      "name" : "transpose_85"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_3_1x1_down\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_28\/Relu",
      "K" : 512,
      "blob_biases" : 249,
      "name" : "vggface_senet50\/conv3_3_1x1_down\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_85",
      "weights" : {
        "per_ch_qscale" : 255,
        "W_U4" : 251,
        "per_ch_qbias" : 253
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_3_1x1_up\/BiasAdd",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/conv3_3_1x1_up\/BiasAdd",
      "K" : 32,
      "blob_biases" : 257,
      "name" : "vggface_senet50\/conv3_3_1x1_up\/BiasAdd",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "vggface_senet50\/activation_28\/Relu",
      "weights" : {
        "per_ch_qscale" : 263,
        "W_U4" : 259,
        "per_ch_qbias" : 261
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "vggface_senet50\/conv3_3_1x1_up\/BiasAdd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "vggface_senet50\/activation_29\/Sigmoid",
      "top" : "vggface_senet50\/activation_29\/Sigmoid",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_29\/Sigmoid"
    },
    {
      "bottom" : "batch_norm_20,vggface_senet50\/activation_29\/Sigmoid",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/multiply_5\/mul",
      "nd_mode" : true,
      "top" : "vggface_senet50\/multiply_5\/mul",
      "type" : "elementwise",
      "name" : "vggface_senet50\/multiply_5\/mul",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/multiply_5\/mul,vggface_senet50\/activation_25\/Relu",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "vggface_senet50\/add_5\/add",
      "nd_mode" : true,
      "top" : "vggface_senet50\/add_5\/add",
      "type" : "elementwise",
      "name" : "vggface_senet50\/add_5\/add",
      "beta" : 0
    },
    {
      "bottom" : "vggface_senet50\/add_5\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "vggface_senet50\/activation_30\/Relu",
      "top" : "vggface_senet50\/activation_30\/Relu",
      "type" : "activation",
      "name" : "vggface_senet50\/activation_30\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "vggface_senet50\/conv3_4_1x1_reduce\/Conv2Dx",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "vggface_senet50\/activation_31\/Relu",
      "K" : 512,
      "blob_biases" : 265,
      "name" : "vggface_senet50\/conv3_4_1x1_reduce\/Conv2Dx",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "vggface_senet50\/activation_30\/Relu",
      "weights" : {
        "per_ch_qscale" : 271,
        "W_U4" : 267,
