<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Info.plist</key>
		<data>
		w2QDPw6Jt7NQIO/4KIKsIvXIf8s=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/analytics/coremldata.bin</key>
		<data>
		w0Y/pShWk4CQ8Vts39s1ce7k/sA=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/coremldata.bin</key>
		<data>
		KEt6pa+nLyYACWsdw3hzM9jSJLE=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/metadata.json</key>
		<data>
		23cCfXrBgpvbrGEwzVil7xeox74=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/model.espresso.net</key>
		<data>
		nrn0YSORCyGwyD5HyiuMfjKyBTA=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/model.espresso.shape</key>
		<data>
		E6gdpYB7ofs5DlIJY8/Z5j6MBTw=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/model.espresso.weights</key>
		<data>
		VZWMgJaUs47/22FQuVplK2SGHxY=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/model/coremldata.bin</key>
		<data>
		AyvVi5cUgezTYZFS+H0JNPDYKgA=
		</data>
		<key>Resources/LookKit_FaceNet.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/analytics/coremldata.bin</key>
		<data>
		uxD9LGi0lSWmBgfyj2+uTwbOD/A=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/coremldata.bin</key>
		<data>
		OpXOkK1JZXE1b19CaXKs+0wxw2o=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/metadata.json</key>
		<data>
		AmR8dRDNNzmsJPpMNfGptLgfNDk=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.espresso.net</key>
		<data>
		Su/zSol+wac55HidgcOHLnH7gZI=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.espresso.shape</key>
		<data>
		e+AEibrIh86hJr+fu3PEm0+aTP0=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.espresso.weights</key>
		<data>
		pVFkGYLqzANhDE+y0t40lMNgqeU=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.rank.info.json</key>
		<data>
		G9jOKPMHXIaZBopGKOvWZJFbSho=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model/coremldata.bin</key>
		<data>
		iwAaqkl0mrwRkCEU0nQ4fJokeuQ=
		</data>
		<key>Resources/LookKit_Facial_expression.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/analytics/coremldata.bin</key>
		<data>
		Y/oXLckxNGVbPONswbTzeXTtjDI=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/coremldata.bin</key>
		<data>
		8oncPvM4dtnvuRUlmtAV5IodCUg=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/metadata.json</key>
		<data>
		Mg+pxFq8x4w16MQWTe6l2RKTWHY=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.espresso.net</key>
		<data>
		Yyj4hXaED+rzCLceVBPgidG4iww=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.espresso.shape</key>
		<data>
		Vczatkn5LphVsz/wxK89WTWY2KA=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.espresso.weights</key>
		<data>
		Zv2SJFG1CXiptW1LNYO/w+TMhjI=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.rank.info.json</key>
		<data>
		G9jOKPMHXIaZBopGKOvWZJFbSho=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model/coremldata.bin</key>
		<data>
		hpBh/iiMb6xgB/MqhJ7Zv9D8Oxg=
		</data>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/analytics/coremldata.bin</key>
		<data>
		h5lqIpJ5l9VXn1tklDqlVqW6suM=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/coremldata.bin</key>
		<data>
		Th6MTsWYjVTH6FvdfbXW8Nwx618=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/metadata.json</key>
		<data>
		ozVNPPm86PTMQVNmHTSFD16PpY8=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.espresso.net</key>
		<data>
		du0jZV2ftURI28jYfQwFMMgA9sc=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.espresso.shape</key>
		<data>
		596Y6QbZQpwc5fvAE0bHnrTkMb0=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.espresso.weights</key>
		<data>
		TMCiKtWa0ybBFOss1Q9zqXVO57A=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.rank.info.json</key>
		<data>
		G9jOKPMHXIaZBopGKOvWZJFbSho=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model/coremldata.bin</key>
		<data>
		gJX0YKS/QpkJOpgQI0kBg1KdDfg=
		</data>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/analytics/coremldata.bin</key>
		<data>
		XHaRHDls4/S4FIvlR2Cvn3uHBm0=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/coremldata.bin</key>
		<data>
		VTKVjt9lrUPsKOE3FqSUcEq5gMw=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/metadata.json</key>
		<data>
		93WXnrlFnm5PSsuZgOvq7Qj1Kbs=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/analytics/coremldata.bin</key>
		<data>
		U6sFqbcOyo7P4KTbnpJ3xfxx+1M=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/coremldata.bin</key>
		<data>
		9cBeldGdqRMt98gkmvMHlt6LNOA=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.net</key>
		<data>
		Ia8mkn/o9sUCLwR2lVxKV+R1Gts=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.shape</key>
		<data>
		pGIykBtvmrKc2bzLjzKOVFiEpsw=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.weights</key>
		<data>
		ukaVRazSky6Y0ZeuPVWzuqYzepQ=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model/coremldata.bin</key>
		<data>
		AyvVi5cUgezTYZFS+H0JNPDYKgA=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/analytics/coremldata.bin</key>
		<data>
		gG00dOLWMlX5fQ7aE60Z8MwDxM4=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/coremldata.bin</key>
		<data>
		RAaK1S9ln6zTBCtQArBIgdnSrUo=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.net</key>
		<data>
		foCLQswYAk0IivkF5Hnt/SE33hI=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.shape</key>
		<data>
		zhT4XTUbzKK0FDe9rI8zPp94V1I=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.weights</key>
		<data>
		4OP3u8MT+KbnFqzn8uxrywhV26w=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model2/coremldata.bin</key>
		<data>
		xf6IP9CBrpe6d32aCO+yo7ntv9o=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/DeepLookModels-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			Ev0X3XdafFt4q7tbeDg+XBp4CLRwCHxqOATu0UIqy8Q=
			</data>
		</dict>
		<key>Headers/DeepLookModels.h</key>
		<dict>
			<key>hash2</key>
			<data>
			FeJsd+/62GkIAGP41dlGg9UuEW5+XJNzk2cHEZrT2hE=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/arm64-apple-ios-macabi.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			BM0RDaJOhJMb0AwD9iq5vzt+UZssNEVjatpoQb+N0dc=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/arm64-apple-ios-macabi.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			FITVX0ge5Eh3Ma5lZndippjfpCbmCFv32GohyGrdsrw=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/arm64-apple-ios-macabi.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			n/Q6+Dhk+AHRejUCe1bkKvacMo8iZwPA2EfbkHmkQr0=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/arm64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			BM0RDaJOhJMb0AwD9iq5vzt+UZssNEVjatpoQb+N0dc=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/arm64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			FITVX0ge5Eh3Ma5lZndippjfpCbmCFv32GohyGrdsrw=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/arm64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			n/Q6+Dhk+AHRejUCe1bkKvacMo8iZwPA2EfbkHmkQr0=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/x86_64-apple-ios-macabi.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			BylgEIvAzfoJMQ0OTT8Owt0w6N+AkHPUxXF6P4xzqQs=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/x86_64-apple-ios-macabi.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			PZDJy6f8IozpC7UaIN5b5z1QsSeGyGsNwXjpDJM+sEg=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/x86_64-apple-ios-macabi.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			lF8OV4XKiB8JNmR26ACdSlLvXelELReIdOEKS9NCIfQ=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/x86_64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			BylgEIvAzfoJMQ0OTT8Owt0w6N+AkHPUxXF6P4xzqQs=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/x86_64.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			PZDJy6f8IozpC7UaIN5b5z1QsSeGyGsNwXjpDJM+sEg=
			</data>
		</dict>
		<key>Modules/DeepLookModels.swiftmodule/x86_64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			lF8OV4XKiB8JNmR26ACdSlLvXelELReIdOEKS9NCIfQ=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			8aODPaKHNVyU0xfjURCiyblpBzbPsLPCkVtjIaLkuVM=
			</data>
		</dict>
		<key>Resources/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			gCwwyj19oDfKo2mb7DqMOkXlaHaUMqMXUuktobD6hQg=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			kFGcwxyE2haO0DEliysl1Uc6ea6c7x5Og3q2TyUDt40=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			ti2DJ+YItWHbeqnJoqdK5rjZ0AgGqjf1/l00/blYuRQ=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			SkzfoobBtIzVBE4i2twBmCsFi+LBCEfn4ftEUbN4eZY=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			ktBX10msCsca1gJt79OKqhI5uo3Cf16znw96a753D6E=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			5T7cmZiYypemp46zFqYRPPq9vj4lTUWXzgDmc3Wu+Bo=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			uvHobtBkhAism6PMOYHpWj4hflm2qRN/dBik6rJpseI=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			CJPCiEp21Qvpv+Xxrb6up2khi9N7a6oBM7aTqzbcKdg=
			</data>
		</dict>
		<key>Resources/LookKit_FaceNet.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			RlbpYvxKeaDtzofrS7257fcnX8oavjI2nePUNd1oykQ=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Yjd5kb9LqnoGhjRWoJabSufgILkKraWJ6Mbr31q68cQ=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			6xDVcGkyLqUjgMT8yc33U9lLNc+ED6j1UAlbEJmtF9E=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			5W/55eOZfVYvp7y2VmykvijLvfGhuYaLLfDJ1tvwNkY=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			rnt0vnLYzM9FEesjYvV7rC7i4ipkdYRFOTVwNZKgA9E=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			LJiohWgvFyKgH6rpAkK8nWAQIMqRl/n2FL3U/zbhENg=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model.rank.info.json</key>
		<dict>
			<key>hash2</key>
			<data>
			+KWibjBW62+wbe6z28z9iK50kAIAyYxwtZZru37J1N4=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			6/iWLdYeAhqZZ2hIs4l0Q3zvwklyJIgB+kFBvK/2fVc=
			</data>
		</dict>
		<key>Resources/LookKit_Facial_expression.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9UPvgjfwE4yg89K1jLQeeZnG5teh0L4CpadUaKoUU1k=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			/iFXPqL3FKGvlj3eATTWr7azSnr8+rqUn+WUznYVjck=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			Bk+MQHfSnqaoUXrI060CM7TWmqCGGCL/WpetTv+GaUQ=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			0ymWY2bgKbH9k2oiQbs7jlP44baF8zUjMHFcMkDsYW4=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			ajI+N+obrbzUnTZ89glChdOnzIpo0iSalMwPk0JgSpU=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			6j8tHPukeQ5kytSSGybtkCB6BZRUCY29g1x6NM720Zo=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model.rank.info.json</key>
		<dict>
			<key>hash2</key>
			<data>
			+KWibjBW62+wbe6z28z9iK50kAIAyYxwtZZru37J1N4=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			15TdfqBX1cH6S9GGA8rbHJU1AlNpZU8TsocYzdC6aFI=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_resnet50_Lite.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			sday3qbYdSGPtOyEREiAwMTz98+36XUYlpDwaTj/VEA=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			pjPBUNPQ5NoFjpvf9UHNvup/GgI1qlqXf1kx6j/48U0=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			Hi1TSRpkia9bD+4UtCB0IWSO07lkH5+Nu6Yrx20gqUQ=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			8knvNCmQZ02918QlW110YQvPFGejrAavnov770tFJr8=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			a+mTgzek7DR5HliKDxgk/WFA07Zq6nyVvL6e0cDPxWY=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			FOPE5Yj/F9JfNyNwcsQRlPCKWtW6lIhKFgerZBTVQEY=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model.rank.info.json</key>
		<dict>
			<key>hash2</key>
			<data>
			+KWibjBW62+wbe6z28z9iK50kAIAyYxwtZZru37J1N4=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			x71Q7o7RUS/vMlmhAmMb25Q1DbpZL5ufqmzpRzB1Zvg=
			</data>
		</dict>
		<key>Resources/LookKit_VGGFace2_senet50_Lite.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			6BqIkmc5o5CaQOH+KeJSDpNTDOP8+3w5IAiVhUbHrr8=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			P1C5ck/PVUAh2RszDxtPNK33rXO/Yx3v825oaz/LeMI=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			Dx3qELGh6tcbqC7ZqaoaN0OiyT11pDpGkL4KZV3ugvo=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			qHmzcuM7myQx/XZ1SMWqPp7mZDle16+3zNUxZ2BA4K0=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			s9gyAC1/Y3U9otwXWxxdVO3sZF3EZLYbBH+iprtDBgE=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			ainBaakj/vSvYtp1HlLjk/KmPgRi4V19lPih6Zj8U8Y=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			uZBwzySOTzaIuMmqsqnjLEkE58L1zfkez83dICpGt8M=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			UD1lBdwacPCVkM7Wws4WbQiu02gl7av2cW/pVY5mfM4=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			CJPCiEp21Qvpv+Xxrb6up2khi9N7a6oBM7aTqzbcKdg=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			wgp9m8U/wKv3BwirnAns8O5yW2WAb2PzUn8IS1a+6KE=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			XLn5f6RVf7kECSBD9eDue3WMlvmm63e6JwW1U/pnp08=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Ah9CQZHrYQpAKaT9rzUWBelDVdWUT748pyHYUHo8QRE=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			bvJMvqB0OShO9vADpxJT7dyqevsMNz8BJx4InEjXdPs=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			J6wybUB2kAP5Xmy0PvEqcw0Mi7yY+b+9izOeS3vtC9A=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model1/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/MobileNetV2_SSDLite.mlmodelc/model2/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			SqOJJk/FzzRSNOYZOlHHtr7P5BpXGEtzDb1GmOc/KYg=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
