{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : -1,
      "bias_r" : -1,
      "bias_b" : -1,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078431377187371254
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Conv2d_1a_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv2d_1a_3x3_Activation_output",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "Conv2d_1a_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Conv2d_2a_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv2d_2a_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 5,
      "name" : "Conv2d_2a_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Conv2d_1a_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Conv2d_2b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv2d_2b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "Conv2d_2b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "Conv2d_2a_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "debug_info" : "MaxPool_3a_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "top" : "MaxPool_3a_3x3_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "MaxPool_3a_3x3",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "Conv2d_2b_3x3_Activation_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Conv2d_3b_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv2d_3b_1x1_Activation_output",
      "K" : 64,
      "blob_biases" : 13,
      "name" : "Conv2d_3b_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "MaxPool_3a_3x3_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Conv2d_4a_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv2d_4a_3x3_Activation_output",
      "K" : 80,
      "blob_biases" : 17,
      "name" : "Conv2d_4a_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "Conv2d_3b_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Conv2d_4b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv2d_4b_3x3_Activation_output",
      "K" : 192,
      "blob_biases" : 21,
      "stride_x" : 2,
      "name" : "Conv2d_4b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "Conv2d_4a_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_1_Branch_2_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_1_Branch_2_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 25,
      "name" : "Block35_1_Branch_2_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Conv2d_4b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_1_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_1_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 29,
      "name" : "Block35_1_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Conv2d_4b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_1_Branch_2_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_1_Branch_2_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 33,
      "name" : "Block35_1_Branch_2_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_1_Branch_2_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_1_Branch_0_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_1_Branch_0_Conv2d_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 37,
      "name" : "Block35_1_Branch_0_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Conv2d_4b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_1_Branch_1_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_1_Branch_1_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 41,
      "name" : "Block35_1_Branch_1_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_1_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_1_Branch_2_Conv2d_0c_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_1_Branch_2_Conv2d_0c_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 45,
      "name" : "Block35_1_Branch_2_Conv2d_0c_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_1_Branch_2_Conv2d_0b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "weights" : {

      },
      "debug_info" : "Block35_1_Concatenate",
      "top" : "Block35_1_Concatenate_output",
      "type" : "concat",
      "name" : "Block35_1_Concatenate",
      "bottom" : "Block35_1_Branch_0_Conv2d_1x1_Activation_output,Block35_1_Branch_1_Conv2d_0b_3x3_Activation_output,Block35_1_Branch_2_Conv2d_0c_3x3_Activation_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Block35_1_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_1_Conv2d_1x1_output",
      "K" : 96,
      "blob_biases" : 49,
      "name" : "Block35_1_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "Block35_1_Concatenate_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "bottom" : "Block35_1_Conv2d_1x1_output",
      "MLCustomLayerWeights" : 53,
      "weights" : {
        "MLCustomLayerWeights" : 55
      },
      "parameters_json" : "{\"scale\":0.17000000000000001,\"engineName\":\"scaling\"}",
      "class_name" : "MLCustomLayerWrapper",
      "debug_info" : "lambda_1",
      "top" : "lambda_1_output",
      "type" : "brick",
      "name" : "lambda_1"
    },
    {
      "bottom" : "Conv2d_4b_3x3_Activation_output,lambda_1_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_1",
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "bottom" : "add_1_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Block35_1_Activation",
      "top" : "Block35_1_Activation_output",
      "type" : "activation",
      "name" : "Block35_1_Activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_2_Branch_2_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_2_Branch_2_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 57,
      "name" : "Block35_2_Branch_2_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_1_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_2_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_2_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 61,
      "name" : "Block35_2_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_1_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_2_Branch_2_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_2_Branch_2_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 65,
      "name" : "Block35_2_Branch_2_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_2_Branch_2_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_2_Branch_0_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_2_Branch_0_Conv2d_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 69,
      "name" : "Block35_2_Branch_0_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_1_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_2_Branch_1_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_2_Branch_1_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 73,
      "name" : "Block35_2_Branch_1_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_2_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_2_Branch_2_Conv2d_0c_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_2_Branch_2_Conv2d_0c_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 77,
      "name" : "Block35_2_Branch_2_Conv2d_0c_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_2_Branch_2_Conv2d_0b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "weights" : {

      },
      "debug_info" : "Block35_2_Concatenate",
      "top" : "Block35_2_Concatenate_output",
      "type" : "concat",
      "name" : "Block35_2_Concatenate",
      "bottom" : "Block35_2_Branch_0_Conv2d_1x1_Activation_output,Block35_2_Branch_1_Conv2d_0b_3x3_Activation_output,Block35_2_Branch_2_Conv2d_0c_3x3_Activation_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Block35_2_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_2_Conv2d_1x1_output",
      "K" : 96,
      "blob_biases" : 81,
      "name" : "Block35_2_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "Block35_2_Concatenate_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "bottom" : "Block35_2_Conv2d_1x1_output",
      "MLCustomLayerWeights" : 85,
      "weights" : {
        "MLCustomLayerWeights" : 87
      },
      "parameters_json" : "{\"scale\":0.17000000000000001,\"engineName\":\"scaling\"}",
      "class_name" : "MLCustomLayerWrapper",
      "debug_info" : "lambda_2",
      "top" : "lambda_2_output",
      "type" : "brick",
      "name" : "lambda_2"
    },
    {
      "bottom" : "Block35_1_Activation_output,lambda_2_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_2",
      "top" : "add_2_output",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "bottom" : "add_2_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Block35_2_Activation",
      "top" : "Block35_2_Activation_output",
      "type" : "activation",
      "name" : "Block35_2_Activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_3_Branch_2_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_3_Branch_2_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 89,
      "name" : "Block35_3_Branch_2_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_2_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_3_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_3_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 93,
      "name" : "Block35_3_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_2_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_3_Branch_2_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_3_Branch_2_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 97,
      "name" : "Block35_3_Branch_2_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_3_Branch_2_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_3_Branch_0_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_3_Branch_0_Conv2d_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 101,
      "name" : "Block35_3_Branch_0_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_2_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_3_Branch_1_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_3_Branch_1_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 105,
      "name" : "Block35_3_Branch_1_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_3_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_3_Branch_2_Conv2d_0c_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_3_Branch_2_Conv2d_0c_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 109,
      "name" : "Block35_3_Branch_2_Conv2d_0c_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_3_Branch_2_Conv2d_0b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "weights" : {

      },
      "debug_info" : "Block35_3_Concatenate",
      "top" : "Block35_3_Concatenate_output",
      "type" : "concat",
      "name" : "Block35_3_Concatenate",
      "bottom" : "Block35_3_Branch_0_Conv2d_1x1_Activation_output,Block35_3_Branch_1_Conv2d_0b_3x3_Activation_output,Block35_3_Branch_2_Conv2d_0c_3x3_Activation_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Block35_3_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_3_Conv2d_1x1_output",
      "K" : 96,
      "blob_biases" : 113,
      "name" : "Block35_3_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "Block35_3_Concatenate_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "bottom" : "Block35_3_Conv2d_1x1_output",
      "MLCustomLayerWeights" : 117,
      "weights" : {
        "MLCustomLayerWeights" : 119
      },
      "parameters_json" : "{\"scale\":0.17000000000000001,\"engineName\":\"scaling\"}",
      "class_name" : "MLCustomLayerWrapper",
      "debug_info" : "lambda_3",
      "top" : "lambda_3_output",
      "type" : "brick",
      "name" : "lambda_3"
    },
    {
      "bottom" : "Block35_2_Activation_output,lambda_3_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_3",
      "top" : "add_3_output",
      "type" : "elementwise",
      "name" : "add_3",
      "beta" : 0
    },
    {
      "bottom" : "add_3_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Block35_3_Activation",
      "top" : "Block35_3_Activation_output",
      "type" : "activation",
      "name" : "Block35_3_Activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_4_Branch_2_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_4_Branch_2_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 121,
      "name" : "Block35_4_Branch_2_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_3_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_4_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_4_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 125,
      "name" : "Block35_4_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_3_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_4_Branch_2_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_4_Branch_2_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 129,
      "name" : "Block35_4_Branch_2_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_4_Branch_2_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_4_Branch_0_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_4_Branch_0_Conv2d_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 133,
      "name" : "Block35_4_Branch_0_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_3_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_4_Branch_1_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_4_Branch_1_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 137,
      "name" : "Block35_4_Branch_1_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_4_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_4_Branch_2_Conv2d_0c_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_4_Branch_2_Conv2d_0c_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 141,
      "name" : "Block35_4_Branch_2_Conv2d_0c_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_4_Branch_2_Conv2d_0b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "weights" : {

      },
      "debug_info" : "Block35_4_Concatenate",
      "top" : "Block35_4_Concatenate_output",
      "type" : "concat",
      "name" : "Block35_4_Concatenate",
      "bottom" : "Block35_4_Branch_0_Conv2d_1x1_Activation_output,Block35_4_Branch_1_Conv2d_0b_3x3_Activation_output,Block35_4_Branch_2_Conv2d_0c_3x3_Activation_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Block35_4_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_4_Conv2d_1x1_output",
      "K" : 96,
      "blob_biases" : 145,
      "name" : "Block35_4_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "Block35_4_Concatenate_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "bottom" : "Block35_4_Conv2d_1x1_output",
      "MLCustomLayerWeights" : 149,
      "weights" : {
        "MLCustomLayerWeights" : 151
      },
      "parameters_json" : "{\"scale\":0.17000000000000001,\"engineName\":\"scaling\"}",
      "class_name" : "MLCustomLayerWrapper",
      "debug_info" : "lambda_4",
      "top" : "lambda_4_output",
      "type" : "brick",
      "name" : "lambda_4"
    },
    {
      "bottom" : "Block35_3_Activation_output,lambda_4_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_4",
      "top" : "add_4_output",
      "type" : "elementwise",
      "name" : "add_4",
      "beta" : 0
    },
    {
      "bottom" : "add_4_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Block35_4_Activation",
      "top" : "Block35_4_Activation_output",
      "type" : "activation",
      "name" : "Block35_4_Activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_5_Branch_2_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_5_Branch_2_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 153,
      "name" : "Block35_5_Branch_2_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_4_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_5_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_5_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 157,
      "name" : "Block35_5_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_4_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_5_Branch_2_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_5_Branch_2_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 161,
      "name" : "Block35_5_Branch_2_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_5_Branch_2_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_5_Branch_0_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_5_Branch_0_Conv2d_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 165,
      "name" : "Block35_5_Branch_0_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_4_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_5_Branch_1_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_5_Branch_1_Conv2d_0b_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 169,
      "name" : "Block35_5_Branch_1_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_5_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 171
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block35_5_Branch_2_Conv2d_0c_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_5_Branch_2_Conv2d_0c_3x3_Activation_output",
      "K" : 32,
      "blob_biases" : 173,
      "name" : "Block35_5_Branch_2_Conv2d_0c_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Block35_5_Branch_2_Conv2d_0b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 175
    },
    {
      "weights" : {

      },
      "debug_info" : "Block35_5_Concatenate",
      "top" : "Block35_5_Concatenate_output",
      "type" : "concat",
      "name" : "Block35_5_Concatenate",
      "bottom" : "Block35_5_Branch_0_Conv2d_1x1_Activation_output,Block35_5_Branch_1_Conv2d_0b_3x3_Activation_output,Block35_5_Branch_2_Conv2d_0c_3x3_Activation_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Block35_5_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block35_5_Conv2d_1x1_output",
      "K" : 96,
      "blob_biases" : 177,
      "name" : "Block35_5_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "Block35_5_Concatenate_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 179
    },
    {
      "bottom" : "Block35_5_Conv2d_1x1_output",
      "MLCustomLayerWeights" : 181,
      "weights" : {
        "MLCustomLayerWeights" : 183
      },
      "parameters_json" : "{\"scale\":0.17000000000000001,\"engineName\":\"scaling\"}",
      "class_name" : "MLCustomLayerWrapper",
      "debug_info" : "lambda_5",
      "top" : "lambda_5_output",
      "type" : "brick",
      "name" : "lambda_5"
    },
    {
      "bottom" : "Block35_4_Activation_output,lambda_5_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_5",
      "top" : "add_5_output",
      "type" : "elementwise",
      "name" : "add_5",
      "beta" : 0
    },
    {
      "bottom" : "add_5_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Block35_5_Activation",
      "top" : "Block35_5_Activation_output",
      "type" : "activation",
      "name" : "Block35_5_Activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Mixed_6a_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Mixed_6a_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 256,
      "blob_biases" : 185,
      "name" : "Mixed_6a_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "Block35_5_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 187
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Mixed_6a_Branch_1_Conv2d_0b_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Mixed_6a_Branch_1_Conv2d_0b_3x3_Activation_output",
      "K" : 192,
      "blob_biases" : 189,
      "name" : "Mixed_6a_Branch_1_Conv2d_0b_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "Mixed_6a_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 191
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Mixed_6a_Branch_0_Conv2d_1a_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Mixed_6a_Branch_0_Conv2d_1a_3x3_Activation_output",
      "K" : 256,
      "blob_biases" : 193,
      "stride_x" : 2,
      "name" : "Mixed_6a_Branch_0_Conv2d_1a_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 384,
      "bottom" : "Block35_5_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 195
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Mixed_6a_Branch_1_Conv2d_1a_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Mixed_6a_Branch_1_Conv2d_1a_3x3_Activation_output",
      "K" : 192,
      "blob_biases" : 197,
      "stride_x" : 2,
      "name" : "Mixed_6a_Branch_1_Conv2d_1a_3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "Mixed_6a_Branch_1_Conv2d_0b_3x3_Activation_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 199
    },
    {
      "pad_r" : 0,
      "debug_info" : "Mixed_6a_Branch_2_MaxPool_1a_3x3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "top" : "Mixed_6a_Branch_2_MaxPool_1a_3x3_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "Mixed_6a_Branch_2_MaxPool_1a_3x3",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "Block35_5_Activation_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "Mixed_6a",
      "top" : "Mixed_6a_output",
      "type" : "concat",
      "name" : "Mixed_6a",
      "bottom" : "Mixed_6a_Branch_0_Conv2d_1a_3x3_Activation_output,Mixed_6a_Branch_1_Conv2d_1a_3x3_Activation_output,Mixed_6a_Branch_2_MaxPool_1a_3x3_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_1_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_1_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 896,
      "blob_biases" : 201,
      "name" : "Block17_1_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Mixed_6a_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 203
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_1_Branch_1_Conv2d_0b_1x7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_1_Branch_1_Conv2d_0b_1x7_Activation_output",
      "K" : 128,
      "blob_biases" : 205,
      "name" : "Block17_1_Branch_1_Conv2d_0b_1x7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Block17_1_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 207
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_1_Branch_0_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_1_Branch_0_Conv2d_1x1_Activation_output",
      "K" : 896,
      "blob_biases" : 209,
      "name" : "Block17_1_Branch_0_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Mixed_6a_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 211
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_1_Branch_1_Conv2d_0c_7x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_1_Branch_1_Conv2d_0c_7x1_Activation_output",
      "K" : 128,
      "blob_biases" : 213,
      "name" : "Block17_1_Branch_1_Conv2d_0c_7x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Block17_1_Branch_1_Conv2d_0b_1x7_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1,
      "blob_weights_f16" : 215
    },
    {
      "weights" : {

      },
      "debug_info" : "Block17_1_Concatenate",
      "top" : "Block17_1_Concatenate_output",
      "type" : "concat",
      "name" : "Block17_1_Concatenate",
      "bottom" : "Block17_1_Branch_0_Conv2d_1x1_Activation_output,Block17_1_Branch_1_Conv2d_0c_7x1_Activation_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Block17_1_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_1_Conv2d_1x1_output",
      "K" : 256,
      "blob_biases" : 217,
      "name" : "Block17_1_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 896,
      "bottom" : "Block17_1_Concatenate_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 219
    },
    {
      "bottom" : "Block17_1_Conv2d_1x1_output",
      "MLCustomLayerWeights" : 221,
      "weights" : {
        "MLCustomLayerWeights" : 223
      },
      "parameters_json" : "{\"scale\":0.10000000000000001,\"engineName\":\"scaling\"}",
      "class_name" : "MLCustomLayerWrapper",
      "debug_info" : "lambda_6",
      "top" : "lambda_6_output",
      "type" : "brick",
      "name" : "lambda_6"
    },
    {
      "bottom" : "Mixed_6a_output,lambda_6_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_6",
      "top" : "add_6_output",
      "type" : "elementwise",
      "name" : "add_6",
      "beta" : 0
    },
    {
      "bottom" : "add_6_output",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "Block17_1_Activation",
      "top" : "Block17_1_Activation_output",
      "type" : "activation",
      "name" : "Block17_1_Activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_2_Branch_1_Conv2d_0a_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_2_Branch_1_Conv2d_0a_1x1_Activation_output",
      "K" : 896,
      "blob_biases" : 225,
      "name" : "Block17_2_Branch_1_Conv2d_0a_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Block17_1_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 227
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_2_Branch_1_Conv2d_0b_1x7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_2_Branch_1_Conv2d_0b_1x7_Activation_output",
      "K" : 128,
      "blob_biases" : 229,
      "name" : "Block17_2_Branch_1_Conv2d_0b_1x7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Block17_2_Branch_1_Conv2d_0a_1x1_Activation_output",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 231
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_2_Branch_0_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_2_Branch_0_Conv2d_1x1_Activation_output",
      "K" : 896,
      "blob_biases" : 233,
      "name" : "Block17_2_Branch_0_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Block17_1_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 235
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "Block17_2_Branch_1_Conv2d_0c_7x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_2_Branch_1_Conv2d_0c_7x1_Activation_output",
      "K" : 128,
      "blob_biases" : 237,
      "name" : "Block17_2_Branch_1_Conv2d_0c_7x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "Block17_2_Branch_1_Conv2d_0b_1x7_Activation_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1,
      "blob_weights_f16" : 239
    },
    {
      "weights" : {

      },
      "debug_info" : "Block17_2_Concatenate",
      "top" : "Block17_2_Concatenate_output",
      "type" : "concat",
      "name" : "Block17_2_Concatenate",
      "bottom" : "Block17_2_Branch_0_Conv2d_1x1_Activation_output,Block17_2_Branch_1_Conv2d_0c_7x1_Activation_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "Block17_2_Conv2d_1x1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Block17_2_Conv2d_1x1_output",
      "K" : 256,
      "blob_biases" : 241,
      "name" : "Block17_2_Conv2d_1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 896,
      "bottom" : "Block17_2_Concatenate_output",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 243
    },
    {
      "bottom" : "Block17_2_Conv2d_1x1_output",
      "MLCustomLayerWeights" : 245,
      "weights" : {
        "MLCustomLayerWeights" : 247
      },
      "parameters_json" : "{\"scale\":0.10000000000000001,\"engineName\":\"scaling\"}",
      "class_name" : "MLCustomLayerWrapper",
      "debug_info" : "lambda_7",
      "top" : "lambda_7_output",
      "type" : "brick",
      "name" : "lambda_7"
    },
    {
      "bottom" : "Block17_1_Activation_output,lambda_7_output",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "add_7",
      "top" : "add_7_output",
      "type" : "elementwise",
      "name" : "add_7",
      "beta" : 0
    },
    {
      "bottom" : "add_7_output",
      "weights" : {

